[
    {
        "id":"echoes_of_enchantment",
        "name":"Echoes of enchantment",
        "showInLog":1,
        "stages":[
            {
                "progress":1,
                "logText":"At the Wexlow well, I angered something evil and powerful (named Gamjee, I think) to the point that it pulled me down into the well. I've landed at the well's bottom severely injured, but alive.",
                "rewardExperience":500
            },
            {
                "progress":2,
                "logText":"After I landed with a thud at the bottom of the well and being concussed, I began to hear sounds off in the distance. Were they voices? Were they even real? Maybe a symptom of the concussion perhaps?"
            },
            {
                "progress":3,
                "logText":"After I landed with a thud at the bottom of the well and being concussed, I began to hear sounds off in the distance. Were they voices? Were they even real? Are they the voices of something more sinister?"
            },
            {
                "progress":4,
                "logText":"The voices I thought I heard earlier seem to be persistent and seemed to be getting louder. It was hard to tell if they're real or just a figment of my imagination."
            },
            {
                "progress":5,
                "logText":"Deep inside the well's tunnels, I found eight people being held captive inside a very deep pit."
            },
            {
                "progress":6,
                "logText":"I learned that these people are held captive by a troll and they need me to find a way to free them."
            },
            {
                "progress":7,
                "logText":"I met the troll named Gamjee and listened to what he had to say."
            },
            {
                "progress":8,
                "logText":"In an attempt to help Gamjee and the villagers, I have facilitated a conversation between Gamjee and one of the villagers."
            },
            {
                "progress":9,
                "logText":"I killed Gamjee and in doing so, I found a rope that I think might be helpful in freeing those people in that pit.",
                "rewardExperience":1200
            },
            {
                "progress":11,
                "logText":"I killed Gamjee and in doing so, I realized that I really should go investigate the voices I heard earlier.",
                "rewardExperience":1000
            },
            {
                "progress":10,
                "logText":"The villagers have been freed. I should visit them back in their village of Wexlow."
            },
            {
                "progress":12,
                "logText":"The villagers and Gamjee agreed to a schedule for using the well, ensuring everyone has access to water without conflict. But the villagers are still in the pit.",
                "rewardExperience":2000
            },
            {
                "progress":13,
                "logText":"After the villagers and Gamjee agreed to a compromise, Gamjee gave me a rope and instructed me to use it to free the remaining villagers in the pit."
            },
            {
                "progress":14,
                "logText":"I've visited the people of Wexlow Village after they made it home. They are happy to sleep in their own beds now.",
                "rewardExperience":500,
                "finishesQuest":1
            }
        ]
    }
]